import type { BaseTranslation } from "../i18n-types";

const megaphone: BaseTranslation = {
    modal: {
        backToSelectCommunication: "Вернуться к выбору способа связи",
        selectCommunication: "Выберите способ связи",
        title: "Глобальная связь",
        selectCamera: "Выберите камеру 📹",
        selectMicrophone: "Выберите микрофон 🎙️",
        liveMessage: {
            startMegaphone: "Запустить мегафон",
            stopMegaphone: "Остановить мегафон",
            goingToStream: "Вы собираетесь вести трансляцию",
            yourMicrophone: "ваш микрофон",
            yourCamera: "вашу камеру",
            yourScreen: "ваш экран",
            title: "Мегафон",
            button: "Начать прямое сообщение",
            and: "и",
            toAll: "всем участникам",
            confirm: "Подтвердить",
            cancel: "Отмена",
            notice: `
            Прямое сообщение, или «Мегафон», позволяет отправить видео и звук с камеры и микрофона всем людям, подключённым к комнате или миру.

            Это сообщение будет отображаться в нижнем углу экрана, как видеозвонок или облачко беседы.

            Пример прямого сообщения: «Всем привет, начнём конференцию? 🎉 Следуйте за моим аватаром в зону конференции и откройте видеоприложение 🚀»
            `,
            settings: "Настройки",
        },
        textMessage: {
            title: "Текстовое сообщение",
            notice: `
            Текстовое сообщение позволяет отправить сообщение всем людям, подключённым к комнате или миру.

            Это сообщение будет отображаться в виде всплывающего окна в верхней части страницы и сопровождаться звуком, обозначающим получение информации.

            Пример сообщения: «Конференция в комнате 3 начнётся через 2 минуты 🎉. Вы можете перейти в зону конференции 3 и открыть видеоприложение 🚀»
            `,
            button: "Отправить текстовое сообщение",
            noAccess: "У вас нет доступа к этой функции 😱 Обратитесь к администратору 🙏",
        },
        audioMessage: {
            title: "Аудиосообщение",
            notice: `
            Аудиосообщение — это сообщение в формате «MP3, OGG…», отправленное всем пользователям, подключённым к комнате или миру.

            Это аудиосообщение будет загружено и воспроизведено для всех получателей уведомления.

            Аудиосообщение может содержать запись о том, что конференция начнётся через несколько минут.
            `,
            button: "Отправить аудиосообщение",
            noAccess: "У вас нет доступа к этой функции 😱 Обратитесь к администратору 🙏",
        },
    },
};

export default megaphone;
