import type { BaseTranslation } from "../i18n-types";

const menu: BaseTranslation = {
    title: "Меню",
    icon: {
        open: {
            menu: "Открыть меню",
            invite: "Показать приглашение",
            register: "Зарегистрироваться",
            chat: "Открыть чат",
            userlist: "Список пользователей",
            openEmoji: "Открыть окно выбора эмодзи",
            closeEmoji: "Закрыть меню эмодзи",
            mobile: "Открыть мобильное меню",
            calendar: "Календарь",
            todoList: "Список дел",
        },
    },
    visitCard: {
        close: "Закрыть",
        sendMessage: "Отправить сообщение",
    },
    profile: {
        login: "Войти",
        logout: "Выйти",
    },
    settings: {
        videoBandwidth: {
            title: "Качество видео",
            low: "Низкое",
            recommended: "Рекомендуемое",
            high: "Высокое",
        },
        shareScreenBandwidth: {
            title: "Качество демонстрации экрана",
            low: "Низкое",
            recommended: "Рекомендуемое",
            high: "Высокое",
        },
        bandwidthConstrainedPreference: {
            title: "При ограниченной пропускной способности сети",
            maintainFramerateTitle: "Плавная анимация",
            maintainFramerateDescription:
                "Отдавать приоритет частоте кадров, а не разрешению. Используйте этот режим, когда важна плавность анимации, например при трансляции видеоигр.",
            maintainResolutionTitle: "Читаемый текст",
            maintainResolutionDescription:
                "Отдавать приоритет разрешению, а не частоте кадров. Используйте этот режим, когда важна читаемость текста, например в презентациях или при демонстрации кода.",
            balancedTitle: "Баланс частоты кадров и разрешения",
            balancedDescription: "Старайтесь сохранить баланс между частотой кадров и разрешением.",
        },
        language: {
            title: "Язык",
        },
        privacySettings: {
            title: "Режим отсутствия",
            explanation:
                'Когда вкладка WorkAdventure не видна в браузере, WorkAdventure переключается в «режим отсутствия»',
            cameraToggle: 'Оставлять камеру включённой в «режиме отсутствия»',
            microphoneToggle: 'Оставлять микрофон включённым в «режиме отсутствия»',
        },
        save: "Сохранить",
        otherSettings: "Все настройки",
        fullscreen: "Полноэкранный режим",
        notifications: "Уведомления",
        enablePictureInPicture: "Включить режим «картинка в картинке»",
        chatSounds: "Звуки чата",
        cowebsiteTrigger: "Всегда спрашивать перед открытием веб-сайтов и комнат Jitsi Meet",
        ignoreFollowRequest: "Игнорировать запросы на отслеживание других пользователей",
        proximityDiscussionVolume: "Громкость разговора при приближении",
        blockAudio: "Блокировать фоновые звуки и музыку",
        disableAnimations: "Отключить анимацию карты",
        bubbleSound: "Звук сообщения",
        bubbleSoundOptions: {
            ding: "Звон",
            wobble: "Вибрация",
        },
        displayVideoQualityStats: "Показывать статистику качества видео",
    },
    invite: {
        description: "Поделитесь ссылкой на комнату!",
        copy: "Копировать",
        copied: "Скопировано",
        share: "Поделиться",
        walkAutomaticallyToPosition: "Автоматически перейти к моей позиции",
        selectEntryPoint: "Использовать другую точку входа",
        selectEntryPointSelect: "Выберите точку входа, через которую будут заходить пользователи",
    },
    globalMessage: {
        text: "Текст",
        audio: "Аудио",
        warning: "Транслировать во все комнаты мира",
        enter: "Введите сообщение...",
        send: "Отправить",
    },
    globalAudio: {
        uploadInfo: "Загрузить файл",
        error: "Файл не выбран. Перед отправкой необходимо загрузить файл.",
        errorUpload:
            "Ошибка загрузки файла. Проверьте файл и повторите попытку. Если проблема не исчезнет, обратитесь к администратору.",
        dragAndDrop: "Перетащите файл сюда или нажмите, чтобы загрузить его 🎧",
    },
    contact: {
        gettingStarted: {
            title: "Начало работы",
            description:
                "WorkAdventure позволяет создать онлайн-пространство для свободного общения. Всё начинается с создания собственного пространства. Выберите одну из множества готовых карт нашей команды.",
        },
        createMap: {
            title: "Создайте свою карту",
            description: "Вы также можете создать собственную карту, следуя инструкциям в документации.",
        },
    },
    about: {
        mapInfo: "Информация о карте",
        mapLink: "ссылка на эту карту",
        copyrights: {
            map: {
                title: "Авторские права на карту",
                empty: "Создатель карты не указал авторские права на карту.",
            },
            tileset: {
                title: "Авторские права на наборы тайлов",
                empty: "Создатель карты не указал авторские права на наборы тайлов. Это не означает, что у этих наборов нет лицензии.",
            },
            audio: {
                title: "Авторские права на аудиофайлы",
                empty: "Создатель карты не указал авторские права на аудиофайлы. Это не означает, что у этих файлов нет лицензии.",
            },
        },
    },
    chat: {
        matrixIDLabel: "Ваш Matrix ID",
        settings: "Настройки",
        resetKeyStorageUpButtonLabel: "Сбросить хранилище ключей",
        resetKeyStorageConfirmationModal: {
            title: "Подтверждение сброса хранилища ключей",
            content: "Вы собираетесь сбросить хранилище ключей. Продолжить?",
            warning:
                "Сброс хранилища ключей удалит текущий сеанс и всех доверенных пользователей. Вы можете потерять доступ к некоторым старым сообщениям, а система перестанет считать вас доверенным пользователем. Перед продолжением убедитесь, что понимаете последствия.",
            cancel: "Отмена",
            continue: "Продолжить",
        },
    },
    sub: {
        profile: "Профиль",
        settings: "Настройки",
        credit: "Благодарности",
        globalMessages: "Глобальные сообщения",
        contact: "Контакты",
        report: "Сообщить о проблеме",
        chat: "Чат",
        help: "Помощь и руководства",
        contextualActions: "Контекстные действия",
        shortcuts: "Быстрые клавиши",
    },
    shortcuts: {
        title: "Быстрые клавиши",
        keys: "Клавиша",
        actions: "Действие",
        moveUp: "Двигаться вверх",
        moveDown: "Двигаться вниз",
        moveLeft: "Двигаться влево",
        moveRight: "Двигаться вправо",
        speedUp: "Бежать",
        interact: "Взаимодействовать",
        follow: "Следовать",
        openChat: "Открыть чат",
        openUserList: "Открыть список пользователей",
        toggleMapEditor: "Показать/скрыть редактор карт",
        rotatePlayer: "Повернуть персонажа",
        emote1: "Эмоция 1",
        emote2: "Эмоция 2",
        emote3: "Эмоция 3",
        emote4: "Эмоция 4",
        emote5: "Эмоция 5",
        emote6: "Эмоция 6",
        openSayPopup: "Открыть окно фразы",
        openThinkPopup: "Открыть окно мысли",
        walkMyDesk: "Подойти к своему столу",
    },
};

export default menu;
