import type { BaseTranslation } from "../i18n-types";

const report: BaseTranslation = {
    block: {
        title: "Заблокировать",
        content: "Заблокировать любые сообщения от пользователя {userName} и ему. Это можно отменить.",
        unblock: "Разблокировать пользователя",
        block: "Заблокировать пользователя",
    },
    title: "Пожаловаться",
    content: "Отправить сообщение с жалобой администраторам этой комнаты. Позже они могут заблокировать пользователя.",
    message: {
        title: "Ваше сообщение: ",
        empty: "Сообщение жалобы не может быть пустым.",
        error: "Ошибка сообщения жалобы. Вы можете связаться с администратором.",
    },
    submit: "Пожаловаться на пользователя",
    moderate: {
        title: "Модерация пользователя {userName}",
        block: "Заблокировать",
        report: "Пожаловаться",
        noSelect: "ОШИБКА: действие не выбрано.",
    },
};

export default report;
